# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(data = np.random.randint(1,4,100))
s2 = pd.Series(data = np.random.randint(1,3,100))
s3 = pd.Series(data = np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1,s2,s3],axis=1)
df

    0  1      2
0   2  2  16487
1   1  1  28237
2   2  2  28692
3   3  1  19818
4   1  2  14549
.. .. ..    ...
95  2  2  11641
96  1  1  25972
97  2  1  10216
98  2  2  29654
99  2  1  13797

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.rename(columns = {0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       2       2            16487
1       1       1            28237
2       2       2            28692
3       3       1            19818
4       1       2            14549
..    ...     ...              ...
95      2       2            11641
96      1       1            25972
97      2       1            10216
98      2       2            29654
99      2       1            13797

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([s1,s2,s3],axis=0).to_frame()
bigcolumn

        0
0       2
1       1
2       2
3       3
4       1
..    ...
95  11641
96  25972
97  10216
98  29654
99  13797

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        2
1        1
2        2
3        3
4        1
..     ...
295  11641
296  25972
297  10216
298  29654
299  13797

[300 rows x 1 columns]